OpenFOAM-v2412/tutorials/incompressible/adjointOptimisationFoam/topologyOptimisation/monoFluidAero/laminar/1_Inlet_2_Outlet/porosityBased/R_10x-init/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Inlet
    {
        name    IEntranceSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-1.0 0.0 0.0)(0.0 1.0 1.0);
        }
    }

    // Outlet
    {
        name    OEntranceSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-1.0 -1.0 0.0)(1.0 0.0 1.0);
        }
    }

    // Outlet-right
    {
        name    OREntranceSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (1.0 0.0 0.0)(2.0 1.0 1.0);
        }
    }

    // Design space
    {
        name    designSpace;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0.0 0.0 0.0)(0.1 0.1 1.0);
        }
    }
    
    // Initialisation
    /*
    {
        name    init;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0.0 0.0 0.0)(0.45 0.25 1.0);
        }
    }
    */
);

// ************************************************************************* //
